fio/results/fio-res_201904220400
Seq-Read-1m: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Seq-Write-1m: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Rand-Read-4k-32qd: (g=2): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Write-4k-32qd: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.1
Starting 4 processes
3;fio-3.1;Seq-Read-1m;0;0;688128;68723;67;10013;51;488;70.902199;22.898973;2719;21405;14823.096789;4159.763548;1.000000%=2867;5.000000%=3096;10.000000%=3850;20.000000%=16056;30.000000%=16187;40.000000%=16187;50.000000%=16318;60.000000%=16318;70.000000%=16318;80.000000%=16449;90.000000%=16449;95.000000%=16580;99.000000%=17432;99.500000%=17956;99.900000%=21364;99.950000%=21364;99.990000%=21364;0%=0;0%=0;0%=0;2778;21470;14894.775969;4162.675677;47407;158268;78.590482%;54009.736842;25259.552910;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.149820%;0.449461%;673;0;288;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;10.42%;1.04%;88.39%;0.15%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39061;36600;0;0;365687;365290;731130;98.25%
3;fio-3.1;Seq-Write-1m;1;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;688128;68730;67;10012;53;180;87.651440;19.615159;2871;22337;14806.491786;4159.621289;1.000000%=3031;5.000000%=3194;10.000000%=3424;20.000000%=16187;30.000000%=16187;40.000000%=16187;50.000000%=16318;60.000000%=16318;70.000000%=16318;80.000000%=16318;90.000000%=16449;95.000000%=16449;99.000000%=16580;99.500000%=17432;99.900000%=22413;99.950000%=22413;99.990000%=22413;0%=0;0%=0;0%=0;2965;22430;14894.885371;4166.023982;45176;153826;75.118810%;51629.157895;24759.348704;0.219736%;0.469437%;672;0;27;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;11.31%;0.00%;88.39%;0.30%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39061;36600;0;0;365687;365290;731130;98.25%
3;fio-3.1;Rand-Read-4k-32qd;2;0;134740;13459;3364;10011;2;95;9.253706;3.519401;334;20194;9496.208878;2892.151448;1.000000%=651;5.000000%=823;10.000000%=5865;20.000000%=10158;30.000000%=10289;40.000000%=10420;50.000000%=10420;60.000000%=10420;70.000000%=10420;80.000000%=10551;90.000000%=10551;95.000000%=10682;99.000000%=12124;99.500000%=12779;99.900000%=14483;99.950000%=16056;99.990000%=19005;0%=0;0%=0;0%=0;340;20202;9506.126079;2892.856268;8566;29438;71.940122%;9682.421053;4784.036700;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.000000%;7.292707%;31760;0;62;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.09%;2.86%;5.68%;1.05%;0.26%;3.47%;86.58%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39061;36600;0;0;365687;365290;731130;98.25%
3;fio-3.1;Rand-Write-4k-32qd;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;125036;12489;3122;10011;2;50;10.563281;3.633546;808;23076;10232.855749;1244.269199;1.000000%=3883;5.000000%=9895;10.000000%=10289;20.000000%=10420;30.000000%=10420;40.000000%=10420;50.000000%=10420;60.000000%=10420;70.000000%=10420;80.000000%=10551;90.000000%=10551;95.000000%=10551;99.000000%=10813;99.500000%=12517;99.900000%=19005;99.950000%=20578;99.990000%=22675;0%=0;0%=0;0%=0;831;23089;10244.083029;1244.732235;12289;17303;100.000000%;12562.150000;1115.942522;1.818182%;5.474525%;30860;0;28;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.02%;0.13%;0.96%;3.96%;94.86%;0.07%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39061;36600;0;0;365687;365290;731130;98.25%

Seq-Read-1m: (groupid=0, jobs=1): err= 0: pid=22579: Mon Apr 22 04:00:43 2019
   read: IOPS=67, BW=67.1MiB/s (70.4MB/s)(672MiB/10013msec)
    slat (usec): min=51, max=488, avg=70.90, stdev=22.90
    clat (usec): min=2719, max=21405, avg=14823.10, stdev=4159.76
     lat (usec): min=2778, max=21470, avg=14894.78, stdev=4162.68
    clat percentiles (usec):
     |  1.00th=[ 2868],  5.00th=[ 3097], 10.00th=[ 3851], 20.00th=[16057],
     | 30.00th=[16188], 40.00th=[16188], 50.00th=[16319], 60.00th=[16319],
     | 70.00th=[16319], 80.00th=[16450], 90.00th=[16450], 95.00th=[16581],
     | 99.00th=[17433], 99.50th=[17957], 99.90th=[21365], 99.95th=[21365],
     | 99.99th=[21365]
   bw (  KiB/s): min=47407, max=158268, per=78.59%, avg=54009.74, stdev=25259.55, samples=19
   iops        : min=   46, max=  154, avg=52.16, stdev=24.67, samples=19
  lat (msec)   : 4=10.42%, 10=1.04%, 20=88.39%, 50=0.15%
  cpu          : usr=0.15%, sys=0.45%, ctx=673, majf=0, minf=288
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=672,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Seq-Write-1m: (groupid=1, jobs=1): err= 0: pid=22580: Mon Apr 22 04:00:43 2019
  write: IOPS=67, BW=67.1MiB/s (70.4MB/s)(672MiB/10012msec)
    slat (usec): min=53, max=180, avg=87.65, stdev=19.62
    clat (usec): min=2871, max=22337, avg=14806.49, stdev=4159.62
     lat (usec): min=2965, max=22430, avg=14894.89, stdev=4166.02
    clat percentiles (usec):
     |  1.00th=[ 3032],  5.00th=[ 3195], 10.00th=[ 3425], 20.00th=[16188],
     | 30.00th=[16188], 40.00th=[16188], 50.00th=[16319], 60.00th=[16319],
     | 70.00th=[16319], 80.00th=[16319], 90.00th=[16450], 95.00th=[16450],
     | 99.00th=[16581], 99.50th=[17433], 99.90th=[22414], 99.95th=[22414],
     | 99.99th=[22414]
   bw (  KiB/s): min=45176, max=153826, per=75.12%, avg=51629.16, stdev=24759.35, samples=19
   iops        : min=   44, max=  150, avg=50.05, stdev=24.21, samples=19
  lat (msec)   : 4=11.31%, 20=88.39%, 50=0.30%
  cpu          : usr=0.22%, sys=0.47%, ctx=672, majf=0, minf=27
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,672,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4k-32qd: (groupid=2, jobs=1): err= 0: pid=22581: Mon Apr 22 04:00:43 2019
   read: IOPS=3364, BW=13.1MiB/s (13.8MB/s)(132MiB/10011msec)
    slat (nsec): min=2437, max=95341, avg=9253.71, stdev=3519.40
    clat (usec): min=334, max=20194, avg=9496.21, stdev=2892.15
     lat (usec): min=340, max=20202, avg=9506.13, stdev=2892.86
    clat percentiles (usec):
     |  1.00th=[  652],  5.00th=[  824], 10.00th=[ 5866], 20.00th=[10159],
     | 30.00th=[10290], 40.00th=[10421], 50.00th=[10421], 60.00th=[10421],
     | 70.00th=[10421], 80.00th=[10552], 90.00th=[10552], 95.00th=[10683],
     | 99.00th=[12125], 99.50th=[12780], 99.90th=[14484], 99.95th=[16057],
     | 99.99th=[19006]
   bw (  KiB/s): min= 8566, max=29438, per=71.94%, avg=9682.42, stdev=4784.04, samples=19
   iops        : min= 2141, max= 7359, avg=2420.21, stdev=1195.98, samples=19
  lat (usec)   : 500=0.09%, 750=2.86%, 1000=5.68%
  lat (msec)   : 2=1.05%, 4=0.26%, 10=3.47%, 20=86.58%, 50=0.01%
  cpu          : usr=0.00%, sys=7.29%, ctx=31760, majf=0, minf=62
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=33685,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Write-4k-32qd: (groupid=3, jobs=1): err= 0: pid=22582: Mon Apr 22 04:00:43 2019
  write: IOPS=3122, BW=12.2MiB/s (12.8MB/s)(122MiB/10011msec)
    slat (nsec): min=2912, max=50699, avg=10563.28, stdev=3633.55
    clat (usec): min=808, max=23076, avg=10232.86, stdev=1244.27
     lat (usec): min=831, max=23089, avg=10244.08, stdev=1244.73
    clat percentiles (usec):
     |  1.00th=[ 3884],  5.00th=[ 9896], 10.00th=[10290], 20.00th=[10421],
     | 30.00th=[10421], 40.00th=[10421], 50.00th=[10421], 60.00th=[10421],
     | 70.00th=[10421], 80.00th=[10552], 90.00th=[10552], 95.00th=[10552],
     | 99.00th=[10814], 99.50th=[12518], 99.90th=[19006], 99.95th=[20579],
     | 99.99th=[22676]
   bw (  KiB/s): min=12289, max=17303, per=100.00%, avg=12562.15, stdev=1115.94, samples=20
   iops        : min= 3072, max= 4325, avg=3140.25, stdev=278.88, samples=20
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=0.13%, 4=0.96%, 10=3.96%, 20=94.86%, 50=0.07%
  cpu          : usr=1.82%, sys=5.47%, ctx=30860, majf=0, minf=28
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,31259,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=67.1MiB/s (70.4MB/s), 67.1MiB/s-67.1MiB/s (70.4MB/s-70.4MB/s), io=672MiB (705MB), run=10013-10013msec

Run status group 1 (all jobs):
  WRITE: bw=67.1MiB/s (70.4MB/s), 67.1MiB/s-67.1MiB/s (70.4MB/s-70.4MB/s), io=672MiB (705MB), run=10012-10012msec

Run status group 2 (all jobs):
   READ: bw=13.1MiB/s (13.8MB/s), 13.1MiB/s-13.1MiB/s (13.8MB/s-13.8MB/s), io=132MiB (138MB), run=10011-10011msec

Run status group 3 (all jobs):
  WRITE: bw=12.2MiB/s (12.8MB/s), 12.2MiB/s-12.2MiB/s (12.8MB/s-12.8MB/s), io=122MiB (128MB), run=10011-10011msec

Disk stats (read/write):
  xvda: ios=39061/36600, merge=0/0, ticks=365687/365290, in_queue=731130, util=98.25%